"Every 10 minutes" = "Every 10 minutes";
"Manually" = "Manually";
"Rescan" = "Rescan";
"Show Info" = "Show Info";
"Delete selected source" = "Delete selected source";
"Every day" = "Every day";
"Add source..." = "Add source...";
"Every half hour" = "Every 30 minutes";
"Rescan source" = "Rescan source";
"Sources" = "Sources";
"Every hour" = "Every hour";
"Rescan frequency" = "Rescan frequency";
